wintersmith/contents/articles/Java/2015-02-23-netty-codec.html
---
date: 2015-02-23 15:03:32
template: tech.jade
title: Netty 编码与解码
category: Java
chage_frequency: monthly
tag: Java, Netty
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Encoder</a></li>
<li><a href="#sec-2">Decoder</a></li>
</ul>
</div>
</div>

<p>
Netty 在提供了基本事件处理框架和Nio处理的基础上，为了方便应用编写，实现了一些通用的处理器，如编码和解码——几乎是网络应用程序不可缺少的一部分，Netty提供的编码和解码类方便了我们进行编码和解码的工作，在使用netty编程的时候，记得使用这些类，可以减少工作量：
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Encoder</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>MessageToMessageEncoder</code> 提供了将对象编码为字节流的接口：
基于此类，实现了很多现成类：
</p>
<ul class="org-ul">
<li>ZlibEncoder
</li>
<li>LengthFieldPrepender
</li>
<li>CompatibleObjectEncoder
</li>
<li>ObjectEncoder
</li>
<li>ProtobufVarint32LengthFieldPrepender
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Decoder</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>ByteToMessageDecoder</code> 为将字节流解码为消息对象提供了便捷，下面是实例：
基于此ByteToMessageDecoder实现的类如：
</p>
<ul class="org-ul">
<li>HttpObjectDecoder
</li>
<li>HttpResponseDecoder
</li>
<li>HttpRequestDecoder
</li>
<li>DelimiterBasedFrameDecoder <br  />
  分隔符分割的数据对象
</li>
<li>FixedLengthFrameDecoder <br  />
  固定长度的数据报文
</li>
<li>LengthFieldBasedFrameDecoder <br  />
  以长度字段标记报文长度的报文，此种非常常见——报文本身的某个字段标识了报文的整体长度。
</li>
<li>LineBasedFrameDecoder <br  />
  基于行的，以换行为分割的数据报文
</li>
<li>ObjectDecoder <br  />
  extends from  LengthFieldBasedFrameDecoder
</li>
<li>ProtobufVarint32FrameDecoder <br  />
  Protobuf 协议
</li>
<li>SpdyFrameCodec <br  />
  Spdy 协议
</li>
<li>SslHandler <br  />
  ssl握手协议
</li>
<li>ZlibDecoder <br  />
  Zip压缩报文
</li>
<li>ReplayingDecoder <br  />
  提供一个对上层应用来说已经数据完整到达的抽象接口，上层应用不必关心完整性。
</li>
</ul>
</div>
</div>
